{
  "Title": "Sermon - Advent Lutheran Church - September 28, 2025",
  "Preacher": "Unknown",
  "Church": "Advent Lutheran Church",
  "Denomination": "ELCA",
  "Date Preached": "September 28, 2025",
  "Scripture References": [],
  "Key Themes / Topics": [
    "Money",
    "Trust",
    "Evil",
    "Sin",
    "Love",
    "Faith",
    "Compassion"
  ],
  "Tone / Style": [
    "Teaching",
    "Expository"
  ],
  "Intended Audience": [
    "General Congregation"
  ],
  "Metadata Preamble": "A sermon from Advent Lutheran Church, Preached on September 28, 2025, exploring themes of Money, Trust, Evil.",
  "Full Text": "Advent Lutheran Church\nMessage\nSeptember 28, 2025\n23:44\nman. Two weeks, backtoback weeks of very difficult texts from the lectionary. And\n23:50\nso, if you feel the need to buckle in because we're talking about money, talking about people, talking about stuff like that, I totally get it,\n23:56\nunderstand. I give you hope. October, I looked ahead. The passages are lit.\n24:02\nLike, they are going to be so good. I realize no one over here is laughing because you don't know what the word lit\n24:07\nmeans. Uh that's a high school term for very cool. Um the high school students\n24:13\nare laughing at me, which means I just lost my membership to cool club. But uh that's okay. October will be great. But\n24:21\nwe're not we're not in October yet. We're in September and we have these weird strong challenging passages. I\n24:29\nmean, it's it's hard to understand what is Jesus getting at in this passage. And\n24:36\nI realized last week I talked about value. And when we value things, then often that's where our money will go.\n24:42\nBut I never defined money for you. Now, you might be thinking that is a strange statement to make, pastor. We all know\n24:49\nwhat money is and how we def uh define it. It's a dollar. It's made up of a hundred pennies. If you have $20, that's\n24:56\n19 more monies than the single dollar. And I I totally get that. I'm not here to challenge your judgment on math or\n25:03\nthe value of dollar. What I'm here to state is the way in which we think about\n25:08\nmoney, how we define money and its system. Let me explain. I think money is\n25:16\nwhat we determine truth to be or what we trust. Let me explain.\n25:25\nMoney is this object, inanimate object, where we have decided its value based\n25:31\noff of how much energy, pain, and time it requires to do something. And we've\n25:36\npacked that into this singular object into that dollar. And that's how we\n25:42\ndictate how much someone gets paid is by how much we think that is worth. And that is the way in which we also pay for\n25:48\ngoods, right? The more expensive goods usually take more time to create or have\n25:53\na certain amount of value. And so we look at money as we in in a way of\n25:59\ntrust. We act that out and we see that how it changes and affects the world as\n26:05\nwell. Right? If you travel the world, you have to exchange currencies and that's because we trust the systems that\n26:12\nare printing that money a little bit differently. Right? if we go to a third world country, your dollar will get you\n26:18\nfarther than if it's at uh somewhere in Europe or something of that notion. But\n26:24\nwe also value money in the way in which we trust the systems that are valuing it\n26:31\nlike market. If we have trust in a company, then the value of that stock\n26:36\n\nrises because we put trust in its mechanics or whatever it is doing. If we\n26:42\ndon't believe it, then its value goes down. And so, in my opinion, the way in which we actually think and act about\n26:49\nmoney is how we put our trust in it. If you need another example, think of the gas station. You go up to it, you put\n26:56\nyour card into it, and then you select 87,893. Right? Those are the three options in\n27:03\nTexas. Yeah, I got it. Um, you select one of those three. Now, you put the\n27:08\nnozzle in your car and you don't think about it at all. Right? You're trusting the system that it is putting whatever\n27:15\ngrade fuel into your car that you selected and you're trusting that the measurements of the amount of gas that\n27:21\nis going through the pump is right. It is correct. Right? So, we have all these\n27:27\nsystems of trust that we can economize and that is the way in which we exchange\n27:33\ngoods is through trust. And I think it's important for us to think about money as\n27:38\ntrust, especially when we come to this gospel lesson because\n27:45\nwhat is happening? I like I've read through this a number of times, a lot of times actually, and I'm still wrestling\n27:52\nwith, okay, Jesus, like I get that you're God. I get that you've got some\n27:58\nwisdom for me, but I'm really struggling to understand the importance of this parable because it is about a business\n28:04\nowner who has a manager who is not acting appropriately. And the boss is\n28:10\ngoing to fire this manager because he's like, \"Yo, I got went. You're not doing the right thing. Give me all my counts.\n28:17\nGive me all my bookings.\" And then the manager has this human moment of I'm\n28:22\nabout to get fired. I live in an honor-based culture. my honor is going to be stripped from me. What should I\n28:28\ndo? Well, I can't dig because I'm not strong. And I can't beg because that\n28:33\nwill immediately set me in a particular category of how much money I can make. So, you know what? I'm going to be even\n28:40\nmore dishonest. I'm going to do evil upon evil. I'm going to go to my boss's debtors and I'm\n28:48\ngoing to give them some leverage or I'm going to gain some leverage. I'm going to go to them and say, \"If you got a 100\n28:54\njugs of oil, I'm going to make it 50.\" And that person is now indebted to this\n28:59\nmanager, right? He's cut the bill in half. And then he goes to this other person, you owe a 100 things of grain,\n29:06\nnow make it 80. Right? He's setting these things up where he's taking evil and making evil worse. And he's doing\n29:13\nthings against his boss. And then his boss in this instance where the boss is\n29:19\nlosing money, he celebrates the manager. I I'm not\n29:25\ntelling you that's what it says here. He says the master commended the dishonest\n29:30\nmanager because he acted shrewdly. What? I don't get that. I I honestly was\n29:38\nstruggling with what is going on here, Jesus. And I think what it is is Jesus\n29:43\nis trying to reveal the fact that in this world evil is still carried out and then evil\n29:51\n\nis often celebrated in systems that are broken that take advantage of people.\n29:57\nIt's like when game recognizes game. When evil sees other evil being done\n30:03\ninstead of doing something about it. When trust is being broken, it celebrates it because it recognizes that\n30:09\nthe system is flawed and it can use its leverage to gain more for itself.\n30:17\nAnd that's the only way I can think about this passage because Jesus then talks about you cannot serve God and you\n30:23\ncannot also serve wealth. And I realized when we talk about money as a system of\n30:29\ntruth, we as humans have this innate desire to make whatever we trust in a\n30:36\ngod. Right? It's this system that we hold as value. It's something we use to\n30:42\ncommunicate. It's something that supports us. It's something that enables us to carry on. And so when Jesus is\n30:47\ntalking about systems of evil and he talks about you cannot serve God and you cannot serve money, it's because money\n30:54\nas a system of trust is imperfect and it can be used for you or against you. And\n31:02\nthat's something we have to be aware of when we're thinking about money. the way in which we communicate, the way in\n31:07\nwhich we use it, the way in which it's prescribed, not just in church, but in\n31:12\nthe grand economic systems of our life. Now, I'm not here to say money is bad. I\n31:18\nam a human being. When I get money, I'm happy. When I lose money, I'm sad, right? I'm simplistic in that regard.\n31:24\nBut what I am encouraging us to think about is how we use our systems of trust\n31:29\nwith one another. How we act them, how we carry them out, and how we think about them. Because then the question\n31:36\nbecomes, what's the antidote to the potential evil of a system of trust that\n31:44\nis both good and can be abused? And that's where our first Timothy reading\n31:50\ncomes into play. First Timothy is a letter that Paul writes to Timothy as he\n31:56\nhas gone to this church in Ephesus to help it out. Paul planted this church in\n32:02\nEphesus. It grew like mad. And since Paul has left, the leadership has done\n32:07\nsome nefarious things. There's some men that are in leadership that are telling\n32:13\npeople they can't they shouldn't get married. That's against God's code. That people are condemned for the food that\n32:18\nthey're eating despite them not being um Jewish in heritage. They're Gentiles.\n32:24\nAnd then there's this other group of women that are using their money, their their power to lower all the other\n32:31\nwomen. And it's creating this system of dynamics that are difficult. And I know when I say first Timothy, there's a mix\n32:37\nof emotions. So I'm not about to go into that. But what I want to talk about is what Paul has to say about our systems\n32:44\nof trust as an antidote to the way in which we perceive money. Because Paul\n32:49\nthen writes to Timothy and says, \"Hey, your mission here is to not dismantle these systems. It's not to break them\n32:56\ndown and destroy them and make another humanistic system. Rather, what I'm encouraging you to do, Timothy, is to\n33:04\n\nencourage those people to pursue the good fight.\n33:10\nTo encourage them to love, encourage them to discover\n33:15\nrighteousness, godliness, love, compassion, faith.\n33:21\nthese aspects of humanity that hold a lot more value\n33:28\nin my opinion than the dollar does because what happens when you lose\n33:34\neverything? The psalm talks about it when someone loses everything and they are in ash or that they are in dust. And\n33:41\nI totally get the ash statement. I come from California. I've witnessed house burnings. My I know all about what it's\n33:48\nlike to lose everything. What do you have left when you no longer\n33:54\nhave the dollar? All you have is your soul. All you have is the way in which\n34:00\nyou treat people, how you love on people, the way in which you are compassionate. And that con currency can\n34:07\nbe way more valuable than the dollar. And even TV\n34:12\ndemonstrates that. I know that's a crazy statement to make,\n34:18\nbut my favorite show in the whole wide world is Survivor. You don't have any money on you. All you have is yourself.\n34:25\nNow, it's a game that's maniacal. I'll give it that. It's about lying. It's about deceiving. It's about cheating.\n34:31\nBut in the group stage, the people that are voted out the quickly, the quickest, are those whom do not have good\n34:37\ncharacter. Th those who the people in their group don't feel like they can trust. those within their group that\n34:44\nthey don't feel like has compassion, those who characters are being\n34:49\nchallenged. And so I think the antidote to\n34:55\na lot of the pain and suffering in the world is the way in which we act, the way in which we are heroes to\n35:03\none another, the way in which we love, the way in which we think, the way in which we encourage, the way in which we\n35:08\nfight the good fight. Because we can't always trust the\n35:14\nsystems that are created before us. They're beautiful. They're powerful things. I'm not here to shout anarchy\n35:22\nagainst money. No. But systems can be corrupted. Evil can\n35:28\nbe celebrated. And the power of our faith is that we believe in something greater than money.\n35:34\nWe don't worship money. We believe in the true thing that we can trust in\n35:40\nwholeheartedly. even when our life is in ashes.\n35:46\nThat's the power of our faith. And we are called to fight the good fight to encourage others so that evil never\n35:54\nwins. Amen.\n36:04\nLet us rise as we sing our next song."
}