{
  "Title": "Sermon - Bethel Lutheran Church - Second Sunday Of Advent",
  "Preacher": "Unknown",
  "Church": "Bethel Lutheran Church",
  "Denomination": "ELCA",
  "Date Preached": "Second Sunday Of Advent",
  "Scripture References": [
    "Isaiah\n12:47",
    "Isaiah 11",
    "Psalm 72",
    "Romans 15",
    "Isaiah\n41:57",
    "John\n52:10"
  ],
  "Key Themes / Topics": [
    "Love",
    "Sin",
    "Peace",
    "Holy Spirit",
    "Grace",
    "Repentance",
    "Hope"
  ],
  "Tone / Style": [
    "Teaching",
    "Expository"
  ],
  "Intended Audience": [
    "General Congregation"
  ],
  "Metadata Preamble": "A sermon from Bethel Lutheran Church, Preached on Second Sunday Of Advent, based on Isaiah\n12:47, Isaiah 11, Psalm 72, exploring themes of Love, Sin, Peace.",
  "Full Text": "anscript\n3:13\nHallelujah.\n5:12\nJesus\n5:18\nforever.\n5:47\nI just\n5:53\nThere you go.\n6:21\nGood morning. Sorry about that. Go for it.\n6:27\nGood morning, y'all. Um, welcome to worship today. Welcome to everyone online on this second Sunday of Advent.\n6:35\nToday we will light the candle of peace. You will notice that you've got the and third string here today. Pastor Richard\n6:44\nuh had a surgery on Friday. Um Renee uh\n6:49\nI talked to him this morning. He said he's Today's kind of a hard day. So,\n6:54\nwe've got him on our prayers and if you came in and have already signed the\n7:00\nprayers, uh we've added a few extra letters at the back. So, make sure uh to go to the back and sign those those\n7:06\nletters. They mean a lot to the people who received them. So, um,\n7:12\nlet's see there. We don't have a whole lot on our list. We do have quilting at Christ on Tuesday and, uh, we have\n7:21\ncouncil meeting at Christ scheduled. Um, so those are the only things. If you\n7:28\npicked up an angel and you haven't gotten your quilt or your pillowcase, please make sure to do that. And I do\n7:35\nwant to share with you that thanks be to God, we have adopted 27 angels this year\n7:42\nand that is the most that we've ever done. So, um, God is always so good and\n7:48\ngracious and God always provides. And so, thank you to all of you for sharing\n7:54\nyour generosity and the gifts that you've been given uh with other people in our community. So, we give thanks for\n8:00\nthat. We do have quite a few prayers uh today. We will for our normal prayer\n8:05\nlist and we have added Jan Mulestein to the prayer list. We have Gruben um\n8:12\nPastor JT and Christine Miller. They were in a car accident and uh so we're\n8:18\nthey're doing okay but they're recovering. So we're praying for their recovery. Uh we're praying for Denise\n8:23\nWhite and of course we will be praying for Pastor Richard. So um\n8:35\nUh, what's the the last name? Stacy with a V.\n8:42\nValor. Okay. And we'll add Stacy to our prayers as well. Um, so before we be\n8:48\nbegin, uh, if we could all just just ask you to bow your heads and we're going to take just a minute of silence. Yes.\n8:55\nI have an announcement I need to make. Oh, yes. Go ahead, Jesse. U want to give everybody a heads up. Uh Karen and I are\n9:02\n\nnot going to be here the week of Christmas. So we've come to that fork in the road where we may be short on people\n9:08\nto run this sound. Uh Craig's going to be gone. Uh and Kelly and uh John,\n9:15\ndepending on what their health is, may or may not be here to run this system either. So, we may not have Zoom uh\n9:23\nunless somebody comes up here next week and figures out at least how to turn the system off. So, just want to give\n9:28\neverybody a heads up on that. Well, and Jesse, I know we've talked about this in the past. This may be a\n9:35\ngood time to bring it up, but um we're looking for people to help with that\n9:40\nministry. It's an important ministry and we need more people who are trained to back up the people who can do it. And so\n9:47\nif you are interested in learning how to do that, uh Jesse, I would assume they need to just talk to you.\n9:54\nYes. And uh and they can train you very well. So if that's a gift that you have, it's\n9:59\na gift that's needed um here in our congregation. So um with that, let us\n10:05\njust take just a moment of silence uh to center as we prepare for our confession\n10:11\nof forgiveness.\n10:20\nThe Holy Spirit calls us together as people of God. We come together in the\n10:25\nname of the Father and of the Son and of the Holy Spirit.\n10:32\nGod of all mercy and consolation, come to the help. Please stand. God of all\n10:37\nmercy and consolation, come to the help of your people, turning us from your our\n10:42\nsin to live for you alone. Give us the power of the Holy Spirit that we may confess our sin, receive our\n10:49\nforgiveness, and grow into the fullness of Jesus Christ, our savior and lord.\n10:55\nAmen. Let us confess together our sin in the presence of God and one another.\n11:07\nMost merciful God, we confess that we are captive to sin and cannot free\n11:13\nourselves. We have sinned against you in thought, word, and deed by what we have\n11:18\ndone and by what we have left undone. We have not loved you with our whole heart.\n11:24\nWe have not loved our neighbors as ourselves. For the sake of your son,\n11:29\nJesus Christ, have mercy on us. forgive us, renew us, and lead us so that we may\n11:36\ndelight in your will and walk in your ways to the glory of your holy name.\n11:42\nAmen. Now hear the good news. God, who is rich\n11:47\nin mercy, loved us even when we were dead in sin, and has made us alive\n11:52\ntogether with Christ. By grace, you have been saved. In the name of Jesus Christ,\n11:59\nyour sin is forgiven. Almighty God, strengthen you with power through the\n12:05\nHoly Spirit that Christ may live in your hearts through faith.\n12:10\nAmen. You may be seated as we have the lighting of the Second Advent candle.\n12:42\n\nC the candle of peace. In the days when God's people long for peace, Isaiah\n12:47\ndeclared, \"Comfort, oh comfort my people, says your God. Speak tenderly to\n12:53\nJerusalem and cry to her that she has served her term, that her penalty is\n12:58\npaid, and that she has received from the Lord's hand double for all her sins.\n13:05\nWe who gather today also seek comfort and peace. Yet we are unsatisfied with\n13:10\nthe ideas of peace that tell us to keep quiet and go with the flow. We long for\n13:16\nreal peace, true peace, just peace.\n13:21\nWe wait as people who yearn for peace that bears the fruit of community,\n13:27\nequity, and flourishing for all. We light these candles as signs of God's\n13:34\nshocking hope and just peace. May they be beacons calling us to repent and to\n13:40\nlive the good news of Jesus Christ as we wait and watch and labor for the day\n13:45\nwhen all people can gather together to worship and glorify God.\n13:56\nWe will continue with hymn number 249.\n14:06\nPlease stand.\n14:30\nGlor. Glory\n14:48\nevery single\n14:59\nway. All my Christ\n15:18\nour Lord\n15:26\nyour grace away\n15:34\nand stretch your hand\n15:44\nand make us Christ to God.\n15:56\nand build the world without\n16:04\nall\n16:10\nYou save us\n16:17\nwith the adore.\n16:32\nThe grace of our Lord Jesus Christ, the love of God, and the communion of the Holy Spirit be with you all. and also\n16:39\nwith you. In peace, let us pray to the Lord.\n16:48\nLord have mercy. For the peace from above and for our\n16:56\nsalvation, let us pray to the Lord.\n17:07\nFor the peace of the whole world, for the well-being of the church of God, and\n17:13\nfor the unity of all. Let us pray to the Lord.\n17:21\n\nLord have mercy for this holy house and for all who\n17:29\noffer here their worship and praise. Let us pray to the Lord.\n17:37\nLord have mercy.\n17:43\nHelp save comfort and defend us gracious Lord.\n17:55\nThis is the feast of victory for our God. Hallelujah.\n18:05\nWorthy is Christ the lamb who was slain\n18:11\nwhose blood set us free to be people of\n18:17\nGod. Power and riches and wisdom and strength\n18:26\nand blessing and glory are his.\n18:33\nThis is the feast of victory for our God. Hallelu.\n18:45\nSing with all the people of God and join\n18:52\nin the hill of all creation.\n18:58\nBlessing. Glory and might be to God and the Lamb\n19:08\nforever. Amen. This is the feast of victory for our\n19:18\nGod. For the lamb who was slain has begun his reign. Hallelujah.\n19:30\nHallelu.\n19:35\nLet us pray together the prayer of the day. Stir up our hearts, Lord God, to\n19:41\nprepare the way of your only son. By his coming, nurture our growth as people of\n19:48\nrepentance and peace, through Jesus Christ, our savior and lord, who lives and reigns with you and\n19:55\nthe Holy Spirit, one God, now and forever. Amen. You may be seated. God\n20:02\nspeaks to us in scripture reading, preaching, and in song.\n20:08\nThis is hard.\n20:14\nI am stepping in for Caitlyn and Jake today. And the first reading comes from Isaiah 11 1-10.\n20:22\nA shout shall come out from the stump of Jesse, and a branch shall grow out of its roots. The spirit of the Lord shall\n20:30\nrest on him, the spirit of wisdom and understanding, the spirit of counsel and\n20:35\nmight. The spirit of knowledge and the fear of the Lord. His delight shall be\n20:41\nin the fear of the Lord. He shall not judge by what he his eyes see or decide\n20:47\nby what his ears hear, but with righteousness he shall judge for the poor and decide with equity for the\n20:55\noppressed of the earth. strike the earth with the rod of his mouth and with the\n21:01\nbreath of his lips he shall kill the wicked. The righteous shall be bel\n21:06\nshall be the belt around his waist and faithfulness the belt around his loins.\n21:12\n\nThe wolf shall live with the lamb and the leopard shall lie down with the kid\n21:18\nand the calf and the lion will feed together and a little child shall lead them. The cow and the bear shall graze,\n21:26\ntheir young shall lie down together, and the lion shall eat straw with ox. The\n21:32\nnursing child shall play over the hole of an asp. And the wean child shall put\n21:37\nits hand on the add's den. They will not hurt or destroy on all my holy mountain.\n21:45\nFor the earth will be full of the knowledge of the Lord, and the waters cover the sea. On that day, the root of\n21:53\nJesse shall stand as a signal to the peoples. The nations shall inquire of\n21:58\nhim, and his dwelling shall be glorious. Word of God. Word of life.\n22:05\nThanks be to God. Read responsibly Psalm 72.\n22:10\nGive the king your justice, oh God, and your righteousness to the king's son.\n22:16\nthat he may rule your people righteously and the poor with justice.\n22:21\nThat the mountain shall bring prosperity to the people and the hills in righteousness.\n22:27\nLet him defeat the needy among the people. Resue the poor and crush the oppressor.\n22:34\nMay he live as long as the sun and the moon endure from one generation to\n22:40\nanother. Let him come down like rain upon the m field like showers that water the earth.\n22:49\nIn this time may the righteous flourish and let there be an abundance of peace till the moon shall be no more.\n22:57\nBlessed are you Lord God the God of Israel. You alone who wondous deeds\n23:04\nand blessed be your glorious name forever and may all the earth be filled with your glory. Amen. Amen.\n23:13\nThe second reading comes from Romans 15. Whether whatever was written in former\n23:20\ndays was written for our instruction, so that by steadfastness and by encouragement of the scripture, we might\n23:27\nhave hope. May the God of steadfastness and the encouragement grant you to live\n23:33\nin harmony with one another in accordance with Christ Jesus, so that\n23:38\ntogether you may with one voice glorify the God and Father of your Lord Jesus\n23:44\nChrist. Welcome one another, therefore, just as Christ has welcomed you for the\n23:50\nglory of God. For I tell you that Christ has become a servant of the circumcised\n23:55\non behalf of the truth of God in order that he might confirm the promises given\n24:00\nto the ancestors and that the Gentiles might glorify God for his mercy\n24:08\nas it is written for I will confess you among the Gentiles\n24:14\nand sing praises to your name. And again he says, \"Rejoice, oh gentleness, with\n24:21\nthis with his people.\" And again, praise the Lord with all your gentiles\n24:28\nand let the people praise him. And again Isaiah says, \"The root of Jesse shall\n24:35\n\ncome and one who rises to the rule the Gentiles in him the Gentiles shall\n24:40\nhope.\" May the God of hope fill you with the joy and peace in believing so that\n24:46\nyou may abound in hope by the power of the Holy Spirit. The word of God, word\n24:52\nof life. I can't see\n25:04\nhim shall we go. We have the words of eternal life.\n25:11\nHallelu do the gospel for today and proclaimed\n25:18\nfrom Matthew the 3r chapter beginning with the first verse. Glory to you oh Lord.\n25:25\nIn those days John the Baptist appeared in the wilderness of Judea proclaiming\n25:30\nrepent for the kingdom of heaven has come near. This is the one of whom the prophet Isaiah spoke when he said, \"The\n25:38\nvoice of one crying out in the wilderness, prepare the way of the Lord, make his path straight.\"\n25:44\nNow John wore clothing of camel's hair with a leather belt around his waist,\n25:49\nand his food was locust and wild honey.\n25:55\nThen Jerusalem and all of Judea and all the region were Jordan were coming out to him. And they were baptized by him in\n26:02\nthe river Jordan confessing their sins. But when he saw many of the Pharisees\n26:07\nand Sadducees coming for his baptism, he said to them, \"You brood of vipers, who\n26:15\nwarned you to flee the coming wrath? Therefore, bear fruits worthy of\n26:20\nrepentance, and do not to say to yourselves, we have Abraham as our\n26:26\nancestor. For I tell you, God is able to from these stones to raise up children\n26:32\nto Abraham. Even now, the axe is lying at the root of the tree. Therefore,\n26:38\nevery tree that does not bear good fruit will be cut down and thrown into the fire. I baptize you with water for\n26:46\nrepentance, but the one who is coming after me is more powerful than I, and I\n26:52\nam not worthy to carry his sandals. He will baptize you with the Holy Spirit\n26:58\nand fire. His winnowing fork is in his hand, and he will clear the threshing floor, and will gather the wheat into\n27:04\nthe grainery, but the shaft he will burn with an unquenchable fire. This is the\n27:11\ngospel of the Lord. Praise to you, O Christ. You may be seated.\n27:26\nIt's one of those days. Please pray with me. Lord, may the words\n27:31\nof my mouth, the meditations of my heart be found acceptable in your sight, oh\n27:36\nGod, for you are our rock and our redeemer. Amen.\n27:43\nGrace and peace and joy to you from God who is our father and Jesus who is our\n27:48\nLord and is our savior. John the Baptist was not your ordinary\n27:55\neveryday kind of a guy. Even for someone in Jesus' day and time to say that he\n28:02\n\nwas strange, that would be an understatement. His strange dress, his\n28:07\neating of wild honey and locust, and his message of the baptism of\n28:12\nrepentance of sins made him stand out and drew the attention of even the most\n28:18\npowerful people of Israel. Now, the late\n28:24\nFred Kredic was a disciples of Christ pastor and a\n28:29\nseminary professor, and he described John the Baptist like this. and I'm\n28:35\ngoing to steal from him and use it here and there. He said John the Baptist was\n28:40\na strange kind of guy who would make encourage and draw the teenage Jewish\n28:47\nboys down to the as he cruised by on their camp. They would see him and then\n28:54\nthey would go off to the side so they wouldn't be in direct sight of John the Baptist but it was safe for them and\n29:00\nthey would park their camels and then they would get out and go and sit on the\n29:05\nhood of their camels to watch what was going on. So let's take a key from them. Let's\n29:12\ndrive by in our pickups and make sure that we're on the other side of those\n29:18\ncool teenage Jewish boys sitting on the hood of their camels and let's back up,\n29:23\nlet the tailgate down and go sit on the tailgate. And you know, there's always a\n29:28\nYeti in the back of a good pickup and it's full of all kinds of beverages. We're going to need those beverages as\n29:35\nwe sit in that hot Middle Eastern sun. And then let's see what we can see where\n29:42\nwe're se sitting on the back of our tailgates next to those cool teenagers.\n29:48\nOf course, surely that distance that we have and the barrier of those teenagers\n29:54\non the camel, that should give us some space and give us some insulation from John the Baptist words. Don't you think?\n30:03\nSo as we sit there, we hear the message of the Baptist, the one crying out in\n30:08\nthe wilderness as he cries out, \"Repent for the kingdom of heaven has come near.\n30:13\nWe know that repent means to turn around, to try another way, to redirect,\n30:20\nmaybe just change our things a little bit, but it means that we know that we can't keep going like we have been\n30:26\ngoing. So we change our ways.\" So what John the Baptist was doing was\n30:32\noffering the common poor, powerless, hopeless Jewish people another vision or\n30:39\na renewed hope. This hope of a new way of thinking drew the people down to the\n30:44\nriver down to the same river that and many years ago in their forkl and\n30:51\ntheir stories Joshua took their ancestors across from the desert where\n30:57\nthey had wandered for 40 years where they had come and escaped\n31:02\nslavery in Egypt where they had been for 400 years. So this river was precious. This river was part of life. They\n31:10\n\nremembered the promises of God there. The Baptist threw them down in such\n31:15\nnumbers that even the Pharisees and Sadducees could not ignore them. See,\n31:21\nJohn the Baptist was eroding the grip that the temple authorities had on the power that they had over these people.\n31:29\nThe Baptist was reminding them that there\n31:34\nGod really did have other plans. Now, these people long for a Messiah.\n31:41\nThey have the vision of a Messiah or someone sent from God to deliver them from the harshness of their\n31:47\npovertystricken existence where they had no voice in how they were governed. They\n31:53\nwere so heavily taxed that they barely eaked out a living and many of them did not.\n32:00\nHunger, need, and want were their constant companions. They wanted relief\n32:06\nfrom the Roman rule which forced compliance or risk their death. The vision of a messiah. This vision also\n32:14\nincluded the people's understanding that since they were God's chosen people,\n32:20\nthey should be the ones in charge of the world. The world should bow down to them\n32:28\nsince God put them in charge. right now. Isn't this the same line that\n32:34\nauthoritarian rulers use wherever they are from beginning of time even up to\n32:39\ntoday? They take God, strip God of what God really is about and they combine it with patriotism and they create\n32:46\nsomething very very powerful but wrong called nationalism. When you\n32:54\ntake and use God's name in vain like that and you use it for power.\n32:59\nSo in all of this, somehow some place the true understanding of what God's\n33:06\nbeing God's chosen people meant got tangled up, lost, and forgotten over\n33:11\ntime. You see, God had set his people apart not to rule the world.\n33:18\nGod set his people apart to be a blessing to the world. They were blessed to be a blessing. They\n33:25\nwere set apart to help the world experience God who creates, sustains,\n33:31\nnurtures, and provides. Not because anyone deserves any of these wonderful\n33:36\ngifts from God, but God set them apart to show the world and experience God by\n33:43\nthe people being the people who loved the stranger, who welcomed a foreigner, the immigrant,\n33:50\nwho gave voice to those who had no voice, to find ways to feed the hungry, to heal\n33:56\nthe sick, and to free those who were unjustly oppressed or in prison. God wanted his chosen people to treat the\n34:04\nworld with love and with grace. God wanted Israel to reveal this loving\n34:13\nstory, this loving creator to all the world. And when you think about it,\n34:19\nthat's what the story of Jonah was all about. That's what the story of Elijah\n34:24\nwho during the drought went not to the Jewish people but found a gentile widow\n34:30\n\nwoman with a son who were eating their last meal and were ready to go and die\n34:36\nbecause their meal and their oil had run out. But because Elijah stayed with them\n34:41\nand they were faithful, they always had meal and oil and they survived the drought. And again, that's what the\n34:48\nstory of Elijah was about. when Israel's most hated, feared enemies, general came\n34:55\ndown with leprosy and he came to Elijah and Elijah healed them. All of these\n35:01\nstories were about a God wanting his chosen people to step outside of their\n35:07\ncomfort zone and love even their enemies because God loved their enemies as well\n35:13\nas them. God at work among Israel's enemies was supposed to remind the\n35:20\npeople of Israel the reason that God chose them. They were to be a blessing\n35:25\nto all of the world, not to rule over to change the world\n35:32\nfrom the inside out using the very most powerful force of all,\n35:39\nthe humble, quiet force of love.\n35:45\nNow, did you notice how John's lips curled? How his voice was filled with disgust when he spotted the Pharisees\n35:52\nand the Sadducees? I mean, even I from where we were sitting on our tailgates\n35:57\nof our pickup with the teenage boys between us and John, even I could hear\n36:02\nthat. You brood of pipers, who warned you to flee the coming wrath? Even now the axe\n36:09\nis lying at the root of the tree. Every good tree that does not bear fruit will be cut down and thrown into the fire.\n36:17\nThese people, the Pharisees and the Sadducees, who were supposed to be the teachers, the leaders of the Jewish\n36:24\npeople, who were supposed to love them, were instead more concerned about not\n36:29\nbreaking rules, about looking good in public, and about gaining even more\n36:35\npower and money than they already had. They were more concerned about being who\n36:40\nthey were supposed to be as a leader who loved God's people. They, as you heard,\n36:45\nrelied upon having Abraham as an ancestor rather than their baptism of repentance bearing good fruit. John was\n36:54\ncalling them out for their hypocrisy. He was confronting them as a prophet. John was holding the leaders of people\n37:02\naccountable for their behavior. And yes, John was preparing the way for\n37:07\nJesus in a new kind of baptism. A new baptism that would be done with\n37:13\nfire and the Holy Spirit. It would separate the shaft from the grain and burn the with an unquenchable fire\n37:23\nnow. And I'm thirsty now. Now, we may think that after we're\n37:28\nsitting on the tailgate of the pickup that we're safely seated away from\n37:34\neverything that John is saying. But there is something about his words\n37:39\nthat cut through both the time and distance as it confronts us just as it\n37:45\n\nconfronted all of the people down at the river 2,000 years ago. If Advent is a\n37:50\ntime for disruption, these words are certainly disrupting. when he confronts them.\n37:57\nHow can we, if we hear those words, not have our conscience pick up and listen?\n38:04\nWhen he confronts them because they are relying on Abraham being their ancestor as a source of salvation,\n38:11\ndo you ever wonder if your attitude about baptism may fall in their general vicinity? Now I'm not taking away the\n38:18\npower of the word water and the word combined because that's very powerful\n38:24\nact there at the baptismal font. God made it known to us that we were his\n38:30\nchildren and that he loved us and he proclaimed to the world this is my child\n38:35\nand that will never change. But as we reflect on our baptism and\n38:40\nGod's work in it, the Holy Spirit not only pulls us into faith, but it moves\n38:46\nus off the tailgate and closer to the Baptist than we may ever think is saved.\n38:52\nAnd let me tell you, anyone who is closer to messenger from God is never\n38:58\nsaved, but it is good. If the people of Israel were blessed to\n39:04\nbe a blessing, what are we children called to be called to do?\n39:15\nDoes that fire which burns away the shaft make you look at our lives?\n39:21\nOr do we get caught up in thinking, well, I'm baptized. I got my ticket to heaven there, and I don't have to worry\n39:27\nabout a thing. I can sit on this tailgate and watch life go by. Whatever happens is okay because I'm my\n39:33\nlast breath. I'm out of here and I'm good. Or have you ever had the idea, well,\n39:39\nwhat we've got to do is legislate God. Heck, let's make it law where we put up\n39:44\nthe Ten Commandments in every classroom because that was shown by God using the law. God loves it.\n39:54\nMaybe that way of thinking is the shaft that's burned up in the\n40:00\nunquenchable fire. Do know that every time people tried to make Jesus king or\n40:06\nan earthly ruler, he walked away from earthly power. That's not what he was\n40:12\nabout. Instead, God is love.\n40:20\nCan never be forced or lab. God works by starting with people's\n40:26\nhearts. Love is what changes hearts. Just like the Hebrew people, we were\n40:32\nblessed to be a blessing to the world. Our response to the love declared to us both in the waters of baptism and then\n40:40\nin with and under the elements of communion that we receive today calls us\n40:45\nin love to go into the world and be the love which moves. Yes, sometimes\n40:51\nconfronts but it changes people. God's love which\n40:56\nuses us in the world makes it possible for others to repent, to rethink\n41:04\n\nto redirect or to go another way. When people experience God's love,\n41:11\nthey have the freedom in that love to repent, to rethink,\n41:18\nand to choose different rights. So in this Advent season as we repent,\n41:24\nrethink, redirect because of the freedom of God's promise and love, we find the\n41:29\nfreedom to ask Jesus, \"What would you have us do? And Jesus, what did you do?\"\n41:38\nRemember Jesus said, \"Whatever you do to the least of these,\n41:44\nyou do unto me.\" What would Jesus do? Well, what he did one day, he stood up in his hometown\n41:51\nsynagogue and he read scripture from Isaiah\n41:57\nwhich spoke of the anointing of the Holy Spirit to bring good news to the poor, proclaim release to the captives and\n42:04\nrecovery of sight to the blind. And then this is what stirred them up. He said, \"Today in your hearing of this, this\n42:13\nscripture has been fulfilled in our lives. The Holy Spirit disrupts\n42:20\nour complacency, shoes us off the tailgate of life and in love directs us\n42:26\ninto the world to be the love that makes a difference. The kind of love which causes the wolf to live with the lamb,\n42:36\nthe leopard to lie down with the kid, the child to be able to lay over the hole of the ass and in the den of\n42:43\nAdders, and perhaps even will take the left and the right and\n42:50\nseek them together on God's high and holy mountain. And there\n42:56\nin God's love, peace abound.\n43:04\nThat love changes everything. That kind of holy disruption that both John the\n43:09\nBaptist and the Advent season brings. That love is what the baptism of fire and the Holy Spirit that brings to the\n43:16\nworld. The thing that the world wants, longs for, and looks for, but it cannot find\n43:24\nor create on its own. But the Holy Spirit, the baptism of God,\n43:31\ngives hope, declares the promise that God loves.\n43:36\nAnd we get to be the people that go out into the world,\n43:41\nbe agents of God's love. So in this Advent season as we go out\n43:47\ninto the world taking that love so that the world is changed by love not by\n43:53\nforce. We also like another John on the last\n43:59\nwords of this book and the last words of the Bible. We look to the east and in\n44:05\nthe midst of everything we also look for the second coming and we say amen. Come\n44:10\nLord Jesus. now s that passes all understanding. Keep and guard your hearts and your\n44:18\nminds in Christ Jesus. Amen.\n44:23\nOur next hymn, if you will notice, it's one verse. We haven't sung it before. So, we'll learn it and we'll sing it.\n44:30\n\nSo, we'll sing two times. I don't have the number, but it's up there.\n44:42\ntwo.\n45:04\nLove you.\n45:12\nof mercy of bread.\n45:20\nAll who are hungry and thirsty. Come and your souls will be fed.\n45:28\nCome at the Lord's invitation. Christ for him.\n45:37\nEat of the bread of salvation. Drink of the blood of the lamb.\n45:45\nCome to the table of mercy. Prepare with the wine and the bread.\n45:54\nAll who are hungry in mercy and their souls will be fed.\n46:03\nat the Lord's invitation. Receive from his guard him.\n46:11\nEat of the bread of salvation. Take the blood of your\n46:44\nPlease stand now as we respond to God's grace in the words of the Nyine Creed.\n46:51\nWe believe in one God, the Father, the Almighty, maker of heaven and earth, of\n46:58\nall that is, seen and unseen. We believe in one Lord Jesus Christ, the only son\n47:06\nof God, eternally begotten of the Father, God from God, light from light,\n47:13\ntrue God from true God, begotten not made, of one being with the Father.\n47:19\nThrough him all things were made. For us and for our salvation, he came down from\n47:26\nheaven, was incarnate of the Holy Spirit and the Virgin Mary, and became truly\n47:32\nhuman. For our sake, he was crucified under Pontious Pilot.\n47:38\nHe suffered death and was buried. On the third day, he rose again in accordance\n47:44\nwith the scriptures. He ascended into heaven and is seated at the right hand of the father. He will\n47:51\ncome again in glory to judge the living and the dead, and his kingdom will have\n47:57\nno end. We believe in the Holy Spirit, the Lord, the giver of life,\n48:03\nwho proceeds from the Father, the Son, who with the Father and the Son is\n48:09\nworshiped and glorified, who has spoken through the prophets. We believe in one holy, Catholic, and\n48:16\napostolic church. We acknowledge one baptism for the forgiveness of sin. We\n48:22\nlook for the resurrection of the dead and of the world to come. Amen.\n48:29\nLet us pray together our offering prayer. Blessed are you, oh God, maker of all\n48:36\nthings. Through your goodness, you have blessed us with these gifts, ourselves,\n48:42\nour time, and our possessions. Use us and what we have gathered in feeding the\n48:49\nworld with your love through the one who gave himself for us, Jesus Christ, our\n48:56\n\nsavior and lord. Amen.\n49:22\nOkay, first\n49:29\nup.\n49:35\nPraise\n50:01\nGod. All blessings. Praise him all creatures dearly.\n50:11\nPraise him. Praise father, son.\n50:32\nIn our waiting and watching, we come to you in prayer, oh God, trusting your\n50:38\npromise to renew the church, the nations, and the whole creation.\n50:53\nGod of wisdom and understanding, inspire the faithful around the world. Unite\n50:59\nhearts and minds in work to address poverty, access to housing, and equity\n51:05\namong peoples. God of grace, here our prayer.\n51:11\nGod of counsel and might, move us to care for creation. As we dream of the\n51:17\nday when all creatures will flourish alongside one another, guide us in ways\n51:23\nhumanity and all creation will mutually thrive. God of grace, here our prayer.\n51:31\nGod of righteousness and faithfulness, encourage nations to live in harmony\n51:36\nwith one another. We pray for international student and teacher exchanges for our partner\n51:43\nchurches and for the shared mission of Lutheran world relief and Lutheran disaster response.\n51:50\nGod of grace, here our prayer. God of steadfastness and encouragement,\n51:57\nstrengthen those who have lost hope in the face of grief, depression or\n52:02\ndisease. Today we pray especially for John and Tammy, Kelly and Becky, John\n52:10\nBill and Belinda, for Greg, for Jan, for Gary Gubin,\n52:18\nfor Pastor JT and Christine Miller and for Denise White.\n52:26\nRenew the spirits of those recovering and medical procedures. And we pray\n52:32\nespecially for Pastor Richard. And we also pray uh for healing for\n52:39\nStacy Fowler. God of grace, here our pray\n52:45\nwith welcome and hospitality embolden us in our shared ministry to overcome all\n52:51\nthat divides and acts of repentance, reconciliation, and reparation. May we serve in the way\n52:59\nof Christ. God of grace, here our pray.\n53:04\nGod of joy and peace, we remember our ancestors in the faith, fill us with the\n53:12\nhope of the Holy Spirit now and into the ages of ages. God of grace\n53:19\nour pray draw near to us oh God as we commend all for whom we pray trusting in your mercy\n53:28\n\nthrough Jesus Christ Emmanuel. Amen.\n53:40\nThe Lord be with you.\n53:48\nWe'll speak the rest. Lift up your hearts. We lift them to the Lord.\n53:53\nLet us give thanks to the Lord our God. It is right to give our thanks and praise. It is indeed right, our duty,\n54:00\nand our joy that we should at all time and in all places give thanks and praise to you, almighty and merciful God,\n54:08\nthrough our savior Jesus Christ, you comforted your people with the promise of the redeemer, through whom you will\n54:14\nalso make all things new. and in the day when he comes to judge the world in righteousness. And so with all the\n54:21\nchoirs of angels, with the church on earth and the host of heaven, we praise you and join their unending hymn.\n54:28\nHoly, holy, holy Lord\n54:35\nGod. Heaven and earth are full of your glory.\n54:43\nHosana in the highest. Blessed is he who comes in the name of\n54:54\nthe Lord. Hosana in the highest.\n55:01\nHoly one, the beginning and the end, the giver of life. Blessed are you for the birth of creation. Blessed are you in\n55:08\nthe darkness and in the light. Blessed are you for your promise to your people.\n55:14\nBlessed are you for the prophet's hopes and dreams. Blessed are you for Mary's openness to your will. Blessed are you\n55:21\nfor your son Jesus Christ, the word made flesh. In the night in which he was\n55:27\nbetrayed, our Lord Jesus took the bread and he gave thanks. He broke it and he\n55:32\ngave it to his disciples saying, \"Take and eat. This is my body which is given for you. Do this in remembrance of me.\n55:41\nAnd again, after supper, he took the cup, he gave thanks, and he gave it for\n55:46\nall to drink, saying, \"This cup is a new covenant in my blood, shed for you and\n55:51\nfor all people, for the forgiveness of sins. Do this for the remembrance of\n55:57\nme.\" Let us then now proclaim the mystery of\n56:02\nthe faith. Christ has died. Christ is risen. Christ will come again. With this\n56:09\nbread and cup, we remember your word dwelling among us. Full of grace and truth. We remember our new birth and his\n56:16\ndeath and resurrection. We look with hope for his coming. Come Lord Jesus.\n56:22\nHoly God, we long for your spirit. Come among us. Bless this meal. May your word\n56:28\ntake flesh in us. Awaken your people. Fill us with your life. Bring the gift\n56:33\nof peace on earth. Come Holy Spirit. All praise and glory are yours. Holy one of\n56:41\nIsrael. Word of God incarnate. Power of the most high, one God now and forever.\n56:48\nAmen. And let us pray together the prayer that Jesus taught us to pray. Our\n56:54\nFather, who art in heaven, be thy name, thy kingdom come, thy will be done on\n57:02\n\nearth as it is in heaven. Give us this day our daily bread. And\n57:07\nforgive us our tresasses as we forgive those who trespass against us. And lead\n57:13\nus not into temptation, but deliver us from evil. For thine is the kingdom and\n57:19\nthe power and the glory forever and ever. Amen. You may be seated.\n57:26\nRemember this is the Lord's table. It is not the Lutheran table. As Lutherans, we declare that believe that in with and\n57:32\nunder the bread and the wine, we receive the body and the blood of Jesus. But we are human. We trust that whatever God\n57:40\nwants us to have when we come to the table, God will give us. So when you come, come with the hope and the trust\n57:48\nthat God is present.\n58:01\nChrist.\n58:10\nChrist.\n58:27\nSo I didn't\n59:00\nHuh? The feast is prepared. Come and receive our Lord Jesus Christ.\n59:11\nJust getting\n59:29\nwater.\n59:36\nGrand\n1:00:32\nYou love your skin.\n1:00:38\nI'm sure.\n1:01:02\nHeat. Heat.\n1:01:12\nAlways\n1:01:38\nteach you.\n1:01:45\nThank you.\n1:02:08\nYes.\n1:02:50\nOh.\n1:02:59\nMay the body and the blood of our Lord Jesus Christ strengthen you and keep you in his peace. May us may live with joy.\n1:03:22\nPlease stand as you're able. We're going to pray the prayer after\n1:03:28\ncommunion silently. Um and I will lead it.\n1:03:39\nOh God, we give you thanks that you have set before us this feast, the body and\n1:03:45\nblood of your son. By your spirit, strengthen us to serve all in need and\n1:03:51\nto give ourselves away as bread for the hungry through Jesus Christ our Lord.\n1:03:56\nAmen.\n1:04:02\nLet us continue with hymn number 717. Let justice flow like streams.\n1:04:29\n\nJustice sparkling water\n1:04:38\nin a grow refreshing earth\n1:04:44\ncleansing sure and righteousness\n1:04:49\nros. Earth is\n1:04:56\nan everflowing stream of way translated\n1:05:02\ninto deep so far\n1:05:11\nthat measure true and justice.\n1:05:38\nMay this Advent season disrupt our lives and make us think and change and take\n1:05:44\ncourage to do what it takes to bear fruits worthy of repentance.\n1:05:51\nBut we don't go out into the world alone. God goes with us. So now, may the\n1:05:56\nLord bless you and keep you. The Lord's face shine upon you with grace and mercy. The Lord look upon you with favor\n1:06:02\nand give you peace. In the name of the Father and of the Son and of the Holy Spirit. Amen.\n1:06:10\nAmen. Amen.\n1:06:16\nAmen.\n1:06:35\nGo in peace and serve the Lord. Thanks be to God.\n1:06:56\nhours.\n1:07:14\nThank you.\n1:07:36\nHappy birthday."
}